particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    return NULL;
}

static void dispatchBleEvent(hal_ble_event_t* evt) {
    for (uint8_t i = 0; i < BLE_MAX_EVENT_CALLBACK_COUNT; i++) {
        if (s_bleEvtCallbacks[i] != NULL) {
            s_bleEvtCallbacks[i](evt);
        }
    }
}

static void isrProcessBleEvent(const ble_evt_t* event, void* context) {
    ret_code_t ret;

    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_SET_TERMINATED: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising stopped.");
            s_isAdvertising = false;
        } break;

        case BLE_GAP_EVT_CONNECTED: {
            // FIXME: If multi role is enabled, this flag should not be clear here.
            s_isAdvertising = false;

            LOG_DEBUG(TRACE, "BLE GAP event: connected.");

            s_bleConnInfo.role             = event->evt.gap_evt.params.connected.role;
            s_bleConnInfo.conn_handle      = event->evt.gap_evt.conn_handle;
            s_bleConnInfo.conn_interval    = event->evt.gap_evt.params.connected.conn_params.max_conn_interval;
            s_bleConnInfo.slave_latency    = event->evt.gap_evt.params.connected.conn_params.slave_latency;
            s_bleConnInfo.conn_sup_timeout = event->evt.gap_evt.params.connected.conn_params.conn_sup_timeout;

            LOG_DEBUG(TRACE, "BLE role: %d", s_bleConnInfo.role);
            LOG_DEBUG(TRACE, "BLE connection handle: %d", s_bleConnInfo.conn_handle);
            LOG_DEBUG(TRACE, "BLE connection interval: (%d x 1.25) ms", s_bleConnInfo.conn_interval);
            LOG_DEBUG(TRACE, "BLE slave latency: %d", s_bleConnInfo.slave_latency);
            LOG_DEBUG(TRACE, "BLE connection supervision timeout: (%d x 10) ms", s_bleConnInfo.conn_sup_timeout);

            // Update connection parameters if needed.
            s_connParamsUpdateAttempts = 0;
            updateConnParamsIfNeeded();

            hal_ble_event_t bleEvt;
            bleEvt.evt_type               = BLE_EVT_TYPE_CONNECTION;
            bleEvt.conn_event.conn_handle = s_bleConnInfo.conn_handle;
            bleEvt.conn_event.evt_id      = BLE_CONN_EVT_ID_CONNECTED;
            if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GAP_EVT_DISCONNECTED: {
            LOG_DEBUG(TRACE, "BLE GAP event: disconnected, handle: 0x%04X, reason: %d",
                      event->evt.gap_evt.conn_handle,
                      event->evt.gap_evt.params.disconnected.reason);

            s_bleConnInfo.conn_handle = BLE_INVALID_CONN_HANDLE;

            // Stop the connection parameters update timer.
            if (!os_timer_is_active(s_connParamsUpdateTimer, NULL)) {
                os_timer_change(s_connParamsUpdateTimer, OS_TIMER_CHANGE_STOP, true, 0, 0, NULL);
            }

            hal_ble_event_t bleEvt;
            bleEvt.evt_type               = BLE_EVT_TYPE_CONNECTION;
            bleEvt.conn_event.conn_handle = s_bleConnInfo.conn_handle;
            bleEvt.conn_event.evt_id      = BLE_CONN_EVT_ID_DISCONNECTED;
            bleEvt.conn_event.reason      = event->evt.gap_evt.params.disconnected.reason;
            if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }

            // Re-start advertising.
            LOG_DEBUG(TRACE, "Restart BLE advertising.");
            ret = sd_ble_gap_adv_start(s_advHandle, BLE_CONN_CFG_TAG);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_adv_start() failed: %u", (unsigned)ret);
            }
            else {
                s_isAdvertising = true;
            }
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter updated.");

            s_bleConnInfo.conn_interval    = event->evt.gap_evt.params.conn_param_update.conn_params.max_conn_interval;
            s_bleConnInfo.slave_latency    = event->evt.gap_evt.params.conn_param_update.conn_params.slave_latency;
            s_bleConnInfo.conn_sup_timeout = event->evt.gap_evt.params.conn_param_update.conn_params.conn_sup_timeout;

            LOG_DEBUG(TRACE, "BLE connection interval: (%d x 1.25) ms", s_bleConnInfo.conn_interval);
            LOG_DEBUG(TRACE, "BLE slave latency: %d", s_bleConnInfo.slave_latency);
            LOG_DEBUG(TRACE, "BLE connection supervision timeout: (%d x 10) ms", s_bleConnInfo.conn_sup_timeout);

            // Update connection parameters if needed.
            updateConnParamsIfNeeded();
        } break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical update request.");
            ble_gap_phys_t phys = {};
            phys.rx_phys = BLE_GAP_PHY_AUTO;
            phys.tx_phys = BLE_GAP_PHY_AUTO;
            ret = sd_ble_gap_phy_update(event->evt.gap_evt.conn_handle, &phys);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_phy_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_PHY_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical updated.");
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length updated.");
            LOG_DEBUG(TRACE, "Max tx octets: %d", event->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets);
            LOG_DEBUG(TRACE, "Max rx octets: %d", event->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets);
            LOG_DEBUG(TRACE, "Max tx time: %d us", event->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us);
            LOG_DEBUG(TRACE, "Max rx time: %d us", event->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us);
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length update request.");

            ble_gap_data_length_params_t gapDataLenParams;
            gapDataLenParams.max_tx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            ret_code_t ret = sd_ble_gap_data_length_update(event->evt.gap_evt.conn_handle, &gapDataLenParams, NULL);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_data_length_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: security parameters request.");

            // Pairing is not supported
            ret_code_t ret = sd_ble_gap_sec_params_reply(event->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, nullptr, nullptr);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_sec_params_reply() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_AUTH_STATUS: {
            LOG_DEBUG(TRACE, "BLE GAP event: authentication status updated.");

            if (event->evt.gap_evt.params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
                LOG_DEBUG(TRACE, "Authentication succeeded");
            }
            else {
                LOG_DEBUG(WARN, "Authentication failed, status: %d", (int)event->evt.gap_evt.params.auth_status.auth_status);
            }
        } break;

        case BLE_GAP_EVT_TIMEOUT: {
            LOG_DEBUG(ERROR, "BLE GAP event: timeout, source: %d", event->evt.gap_evt.params.timeout.src);
        } break;

        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: exchange ATT MTU response.");
            LOG_DEBUG(TRACE, "Effective Server RX MTU: %d.", event->evt.gattc_evt.params.exchange_mtu_rsp.server_rx_mtu);
        } break;

        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);

            // Disconnect on GATT Client timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");

