particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
            // No persistent system attributes
            const uint32_t ret = sd_ble_gatts_sys_attr_set(event->evt.gatts_evt.conn_handle, nullptr, 0, 0);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_sys_attr_set() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: exchange ATT MTU request.");
            LOG_DEBUG(TRACE, "Effective Client RX MTU: %d.", event->evt.gatts_evt.params.exchange_mtu_request.client_rx_mtu);

            ret_code_t ret = sd_ble_gatts_exchange_mtu_reply(event->evt.gatts_evt.conn_handle, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gatts_exchange_mtu_reply() failed: %u", (unsigned)ret);
            }

            LOG_DEBUG(TRACE, "Reply with Server RX MTU: %d.", NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        } break;

        case BLE_GATTS_EVT_WRITE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: write characteristic.");

            hal_ble_char_t* bleChar;
            uint16_t attrHandle = event->evt.gatts_evt.params.write.handle;
            bleChar = findCharacteristic(attrHandle);
            if (bleChar != NULL) {
                if (attrHandle == bleChar->cccd_handle) {
                    LOG_DEBUG(TRACE, "Write CCCD.");
                }
                else if (attrHandle == bleChar->value_handle) {
                    LOG_DEBUG(TRACE, "Write value.");

                    memcpy(bleChar->value, event->evt.gatts_evt.params.write.data, event->evt.gatts_evt.params.write.len);

                    hal_ble_event_t bleEvt;
                    bleEvt.evt_type               = BLE_EVT_TYPE_DATA;
                    bleEvt.data_event.conn_handle = event->evt.gatts_evt.conn_handle;
                    bleEvt.data_event.char_handle = bleChar->value_handle;
                    bleEvt.data_event.data        = bleChar->value;
                    bleEvt.data_event.data_len    = bleChar->value_len;
                    if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                        LOG(ERROR, "os_queue_put() failed.");
                    }
                }
            }
        } break;

        case BLE_GATTS_EVT_HVN_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: notification sent.");
        } break;

        case BLE_GATTS_EVT_HVC: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: indication confirmed.");
            s_indInProgress = false;
        } break;

        case BLE_GATTS_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: timeout, source: %d.", event->evt.gatts_evt.params.timeout.src);

            // Disconnect on GATT Server timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gatts_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        default: {
            LOG_DEBUG(TRACE, "Unhandled BLE event: %u", (unsigned)event->header.evt_id);
        } break;
    }
}

static os_thread_return_t handleBleEventThread(void* param) {
    while (1) {
        hal_ble_event_t bleEvent;
        if (!os_queue_take(s_bleEvtQueue, &bleEvent, CONCURRENT_WAIT_FOREVER, NULL)) {
            dispatchBleEvent(&bleEvent);
        }
        else {
            LOG(ERROR, "BLE event thread exited.");
            break;
        }
    }

    os_thread_exit(s_bleEvtThread);
}

int hal_ble_init(uint8_t role, void* reserved) {
    std::lock_guard<bleLock> lk(bleLock());

    /* The SoftDevice has been enabled in core_hal.c */

    if (!s_bleInitialized) {
        LOG_DEBUG(TRACE, "Initializing BLE stack.");

        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ramStart = 0;
        ret_code_t ret = nrf_sdh_ble_default_cfg_set(BLE_CONN_CFG_TAG, &ramStart);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "nrf_sdh_ble_default_cfg_set() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
        LOG_DEBUG(TRACE, "RAM start: 0x%08x", (unsigned)ramStart);

        // Enable the stack
        ret = nrf_sdh_ble_enable(&ramStart);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "nrf_sdh_ble_enable() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        s_bleInitialized = true;

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(bleObserver, BLE_OBSERVER_PRIO, isrProcessBleEvent, nullptr);

        for (uint8_t i = 0; i < BLE_MAX_EVENT_CALLBACK_COUNT; i++) {
            s_bleEvtCallbacks[i] = NULL;
        }

        s_bleConnInfo.conn_handle = BLE_INVALID_CONN_HANDLE;

        // Configure an advertising set to obtain an advertising handle.
        if (role & BLE_ROLE_PERIPHERAL) {
            hal_ble_adv_params_t params;
            params.type          = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
            params.filter_policy = BLE_GAP_ADV_FP_ANY;
            params.interval      = BLE_DEFAULT_ADVERTISING_INTERVAL;
            params.duration      = BLE_DEFAULT_ADVERTISING_DURATION;
            params.inc_tx_power  = false;

            int error = ble_set_advertising_params(&params);
            if (error != SYSTEM_ERROR_NONE) {
                return error;
            }

            // Set the default TX Power
            ret = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, s_advHandle, s_advTxPower);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_tx_power_set() failed: %u", (unsigned)ret);
                return sysError(ret);
            }
        }

        if (os_queue_create(&s_bleEvtQueue, sizeof(hal_ble_event_t), BLE_EVENT_QUEUE_ITEM_COUNT, NULL)) {
            LOG(ERROR, "os_queue_create() failed");
            return SYSTEM_ERROR_NO_MEMORY;
        }

        if (os_thread_create(&s_bleEvtThread, "BLE Event Thread", OS_THREAD_PRIORITY_NETWORK, handleBleEventThread, NULL, BLE_EVENT_THREAD_STACK_SIZE)) {
            LOG(ERROR, "os_thread_create() failed");
            os_queue_destroy(s_bleEvtQueue, NULL);
            return SYSTEM_ERROR_INTERNAL;
        }

