particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
        if (os_timer_create(&s_connParamsUpdateTimer, BLE_CONN_PARAMS_UPDATE_DELAY_MS, connParamsUpdateTimerCb, NULL, true, NULL)) {
            LOG(ERROR, "os_timer_create() failed.");
        }

        return SYSTEM_ERROR_NONE;
    }
    else {
        return SYSTEM_ERROR_INVALID_STATE;
    }
}

int ble_register_callback(ble_event_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);
    for (uint8_t i = 0; i < BLE_MAX_EVENT_CALLBACK_COUNT; i++) {
        if (s_bleEvtCallbacks[i] == NULL) {
            s_bleEvtCallbacks[i] = callback;
            return SYSTEM_ERROR_NONE;
        }
    }
    return SYSTEM_ERROR_LIMIT_EXCEEDED;
}

int ble_deregister_callback(ble_event_callback_t callback) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);
    for (uint8_t i = 0; i < BLE_MAX_EVENT_CALLBACK_COUNT; i++) {
        if (s_bleEvtCallbacks[i] == callback) {
            s_bleEvtCallbacks[i] = NULL;
            return SYSTEM_ERROR_NONE;
        }
    }
    return SYSTEM_ERROR_NOT_FOUND;
}

int ble_set_device_address(hal_ble_address_t const* addr) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_device_address().");

    if (addr->addr_type != BLE_SIG_ADDR_TYPE_PUBLIC && addr->addr_type != BLE_SIG_ADDR_TYPE_RANDOM_STATIC) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gap_addr_t localAddr;
    localAddr.addr_id_peer = false;
    localAddr.addr_type    = addr->addr_type;
    memcpy(localAddr.addr, addr->addr, BLE_SIG_ADDR_LEN);

    ret_code_t ret = sd_ble_gap_addr_set(&localAddr);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_addr_set() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_get_device_address(hal_ble_address_t* addr) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_get_device_address().");

    ble_gap_addr_t localAddr;
    ret_code_t ret = sd_ble_gap_addr_get(&localAddr);
    if (ret == NRF_SUCCESS) {
        addr->addr_type = localAddr.addr_type;
        memcpy(addr->addr, localAddr.addr, BLE_SIG_ADDR_LEN);
    }
    else {
        LOG(ERROR, "sd_ble_gap_addr_get() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_set_device_name(uint8_t const* device_name, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_device_name().");

    ble_gap_conn_sec_mode_t secMode;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&secMode);

    ret_code_t ret = sd_ble_gap_device_name_set(&secMode, device_name, len);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_device_name_set() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_get_device_name(uint8_t* device_name, uint16_t* len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_get_device_name().");

    // non NULL-terminated string returned.
    ret_code_t ret = sd_ble_gap_device_name_get(device_name, len);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_device_name_get() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_set_appearance(uint16_t appearance) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_appearance().");

    ret_code_t ret = sd_ble_gap_appearance_set(appearance);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_appearance_set() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_get_appearance(uint16_t* appearance) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_get_appearance().");

    ret_code_t ret = sd_ble_gap_appearance_get(appearance);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_appearance_get() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_add_whitelist(hal_ble_address_t* addr_list, uint8_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_add_whitelist().");

    if (addr_list == NULL || len == 0 || len > BLE_MAX_WHITELIST_ADDR_COUNT) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    for (uint8_t i = 0; i < len; i++) {
        s_whitelist[i].addr_id_peer = true;
        s_whitelist[i].addr_type = addr_list[i].addr_type;
        memcpy(s_whitelist[i].addr, addr_list[i].addr, BLE_SIG_ADDR_LEN);
        s_whitelist_ptr[i] = &s_whitelist[i];
    }

    ret_code_t ret = sd_ble_gap_whitelist_set(s_whitelist_ptr, len);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_whitelist_set() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_delete_whitelist(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_delete_whitelist().");

    ret_code_t ret = sd_ble_gap_whitelist_set(NULL, 0);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_whitelist_set() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_set_tx_power(int8_t value) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_tx_power().");

    ret_code_t ret = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, s_advHandle, roundTxPower(value));
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_tx_power_set() failed: %u", (unsigned)ret);
    }

    return sysError(ret);
}

int ble_get_tx_power(int8_t* value) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_get_tx_power().");

    *value = s_advTxPower;

    return SYSTEM_ERROR_NONE;
}

int ble_set_advertising_params(hal_ble_adv_params_t* adv_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_advertising_params().");

    ret_code_t ret;

