particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    // It is invalid to change advertising set parameters while advertising.
    if (s_isAdvertising) {
        int err = ble_stop_advertising();
        if (err != SYSTEM_ERROR_NONE) {
            return err;
        }
        s_advPending = true;
    }

    if (adv_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gap_adv_params_t bleGapAdvParams;
    memset(&bleGapAdvParams, 0x00, sizeof(ble_gap_adv_params_t));

    bleGapAdvParams.properties.type             = adv_params->type;
    bleGapAdvParams.properties.include_tx_power = adv_params->inc_tx_power;
    bleGapAdvParams.p_peer_addr                 = NULL;
    bleGapAdvParams.interval                    = adv_params->interval;
    bleGapAdvParams.duration                    = adv_params->duration;
    bleGapAdvParams.filter_policy               = adv_params->filter_policy;
    bleGapAdvParams.primary_phy                 = BLE_GAP_PHY_1MBPS;

    LOG_DEBUG(TRACE, "BLE advertising interval: (%d x 0.625) ms.", bleGapAdvParams.interval);
    if (bleGapAdvParams.duration == 0) {
        LOG_DEBUG(TRACE, "BLE advertising duration: infinite.");
    }
    else {
        LOG_DEBUG(TRACE, "BLE advertising duration: (%d x 10) ms.", bleGapAdvParams.duration);
    }

    // Make sure the advertising data and scan response data is consistent.
    ble_gap_adv_data_t bleGapAdvData;
    bleGapAdvData.adv_data.p_data      = s_advData;
    bleGapAdvData.adv_data.len         = s_advDataLen;
    bleGapAdvData.scan_rsp_data.p_data = s_scanRespData;
    bleGapAdvData.scan_rsp_data.len    = s_scanRespDataLen;

    ret = sd_ble_gap_adv_set_configure(&s_advHandle, &bleGapAdvData, &bleGapAdvParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_set_configure() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    if (s_advPending) {
        s_advPending = false;
        return ble_start_advertising();
    }

    return sysError(ret);
}

int ble_set_adv_data_snippet(uint8_t adType, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_adv_data_snippet().");

    return adStructEncode(adType, data, len, BLE_ADV_DATA_ADVERTISING);
}

int ble_refresh_adv_data(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_refresh_adv_data().");

    return setAdvData(s_advData, s_advDataLen, BLE_ADV_DATA_ADVERTISING);
}

int ble_set_adv_data(uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_adv_data().");

    return setAdvData(data, len, BLE_ADV_DATA_ADVERTISING);
}

int ble_set_scan_resp_data_snippet(uint8_t adType, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_scan_resp_data_snippet().");

    return adStructEncode(adType, data, len, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_refresh_scan_resp_data(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_refresh_scan_resp_data().");

    return setAdvData(s_scanRespData, s_scanRespDataLen, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_set_scan_resp_data(uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_scan_resp_data().");

    return setAdvData(data, len, BLE_ADV_DATA_SCAN_RESPONSE);
}

int ble_start_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_start_advertising().");

    if (s_isAdvertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_start(s_advHandle, BLE_CONN_CFG_TAG);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_isAdvertising = true;
        return SYSTEM_ERROR_NONE;
    }
}

int ble_stop_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_stop_advertising().");

    if (!s_isAdvertising) {
        return SYSTEM_ERROR_NONE;
    }

    ret_code_t ret = sd_ble_gap_adv_stop(s_advHandle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_adv_stop() failed: %u", (unsigned)ret);
        return sysError(ret);
    }
    else {
        s_isAdvertising = false;
        return SYSTEM_ERROR_NONE;
    }
}

bool ble_is_advertising(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    return s_isAdvertising;
}

int ble_set_scanning_params(hal_ble_scan_params_t* scan_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_scanning_params().");

    if (scan_params->interval < BLE_GAP_SCAN_INTERVAL_MIN) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MIN;
    }
    if (scan_params->interval > BLE_GAP_SCAN_INTERVAL_MAX) {
        scan_params->interval = BLE_GAP_SCAN_INTERVAL_MAX;
    }
    if (scan_params->window < BLE_GAP_SCAN_WINDOW_MIN) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MIN;
    }
    if (scan_params->window > BLE_GAP_SCAN_WINDOW_MAX) {
        scan_params->window = BLE_GAP_SCAN_WINDOW_MAX;
    }

    memcpy(&s_scanParams, scan_params, sizeof(hal_ble_scan_params_t));

    return SYSTEM_ERROR_NONE;
}

int ble_start_scanning(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_start_scanning().");

    ble_gap_scan_params_t bleGapScanParams;
    bleGapScanParams.active        = s_scanParams.active;
    bleGapScanParams.interval      = s_scanParams.interval;
    bleGapScanParams.window        = s_scanParams.window;
    bleGapScanParams.timeout       = s_scanParams.timeout;
    bleGapScanParams.scan_phys     = BLE_GAP_PHY_1MBPS;
    bleGapScanParams.filter_policy = s_scanParams.filter_policy;

    LOG_DEBUG(TRACE, "BLE scan interval: (%d x 0.625) ms.", bleGapScanParams.interval);
    LOG_DEBUG(TRACE, "BLE scan window:   (%d x 0.625) ms.", bleGapScanParams.window);
    LOG_DEBUG(TRACE, "BLE scan timeout:  (%d x 10) ms.", bleGapScanParams.timeout);

