particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    ret_code_t ret = sd_ble_gap_scan_start(&bleGapScanParams, &s_bleScanData);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_stop_scanning(void) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_stop_scanning().");

    ret_code_t ret = sd_ble_gap_scan_stop();
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_connect(hal_ble_address_t* addr) {
    std::lock_guard<bleLock> lk(bleLock());
    return 0;
}

int ble_connect_cancel(void) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_connect_cancel().");

    return 0;
}

int ble_set_ppcp(hal_ble_conn_params_t* conn_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_ppcp().");

    if (conn_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (conn_params->min_conn_interval < BLE_SIG_CP_MIN_CONN_INTERVAL_MIN ||
            conn_params->min_conn_interval > BLE_SIG_CP_MIN_CONN_INTERVAL_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (conn_params->max_conn_interval < BLE_SIG_CP_MAX_CONN_INTERVAL_MIN ||
            conn_params->max_conn_interval > BLE_SIG_CP_MAX_CONN_INTERVAL_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (conn_params->slave_latency > BLE_SIG_CP_SLAVE_LATENCY_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (conn_params->conn_sup_timeout < BLE_SIG_CP_CONN_SUP_TIMEOUT_MIN ||
            conn_params->conn_sup_timeout > BLE_SIG_CP_CONN_SUP_TIMEOUT_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gap_conn_params_t connParams;
    connParams.min_conn_interval = conn_params->min_conn_interval;
    connParams.max_conn_interval = conn_params->max_conn_interval;
    connParams.slave_latency     = conn_params->slave_latency;
    connParams.conn_sup_timeout  = conn_params->conn_sup_timeout;

    ret_code_t ret = sd_ble_gap_ppcp_set(&connParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_ppcp_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_get_ppcp(hal_ble_conn_params_t* conn_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_get_ppcp().");

    if (conn_params == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gap_conn_params_t connParams;
    ret_code_t ret = sd_ble_gap_ppcp_get(&connParams);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_ppcp_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    conn_params->min_conn_interval = connParams.min_conn_interval;
    conn_params->max_conn_interval = connParams.max_conn_interval;
    conn_params->slave_latency     = connParams.slave_latency;
    conn_params->conn_sup_timeout  = connParams.conn_sup_timeout;

    return SYSTEM_ERROR_NONE;
}

int ble_update_connection_params(uint16_t conn_handle, hal_ble_conn_params_t* conn_params) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_update_connection_params().");

    ret_code_t ret;

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (conn_params == NULL) {
        // For Central role, this will reject the connection parameter update request.
        // For Peripheral role, this will use the PPCP characteristic value as the connection parameters,
        // and send the request to Central.
        ret = sd_ble_gap_conn_param_update(conn_handle, NULL);
    }
    else {
        // For Central role, this will initiate the connection parameter update procedure.
        // For Peripheral role, this will use the passed in parameters and send the request to central.
        ble_gap_conn_params_t connParams;
        connParams.min_conn_interval = conn_params->min_conn_interval;
        connParams.max_conn_interval = conn_params->max_conn_interval;
        connParams.slave_latency     = conn_params->slave_latency;
        connParams.conn_sup_timeout  = conn_params->conn_sup_timeout;
        ret = sd_ble_gap_conn_param_update(conn_handle, &connParams);
    }

    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_conn_param_update() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int hal_ble_disconnect(uint16_t conn_handle, uint8_t reason) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "hal_ble_disconnect().");

    if (conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret = sd_ble_gap_disconnect(conn_handle, reason);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_add_service(uint8_t type, hal_ble_uuid_t* uuid, hal_ble_service_t* service) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_add_service().");

    ret_code_t ret;
    ble_uuid_t svcUuid;

    if (uuid == NULL || service == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (s_bleServiceCount >= BLE_MAX_SERVICES_COUNT) {
        return SYSTEM_ERROR_LIMIT_EXCEEDED;
    }

    int err = addUuidIfNeeded(uuid, &svcUuid);
    if (err != SYSTEM_ERROR_NONE) {
        return err;
    }

    ret = sd_ble_gatts_service_add(type, &svcUuid, &service->start_handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_service_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    service->type = type;
    memcpy(&service->uuid, uuid, sizeof(hal_ble_uuid_t));

    s_bleService[s_bleServiceCount] = service;
    s_bleServiceCount++;

    return SYSTEM_ERROR_NONE;
}

