particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
        if (cccd_value == BLE_SIG_CCCD_VAL_INDICATION) {
            s_indInProgress = true;
        }
    }

    return SYSTEM_ERROR_NONE;
}

int ble_set_characteristic_value(hal_ble_char_t* ble_char, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_set_characteristic_value().");

    if (ble_char == NULL || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gatts_value_t gattValue;
    gattValue.len     = len;
    gattValue.offset  = 0;
    gattValue.p_value = data;

    ret_code_t ret = sd_ble_gatts_value_set(0, ble_char->value_handle, &gattValue);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_value_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    ble_char->value_len = gattValue.len;

    return SYSTEM_ERROR_NONE;
}

int ble_get_characteristic_value(hal_ble_char_t* ble_char, uint8_t* data, uint16_t* len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleInitialized);

    LOG_DEBUG(TRACE, "ble_get_characteristic_value().");

    if (ble_char == NULL || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gatts_value_t gattValue;
    gattValue.len     = *len;
    gattValue.offset  = 0;
    gattValue.p_value = data;

    ret_code_t ret = sd_ble_gatts_value_get(0, ble_char->value_handle, &gattValue);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_value_get() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    *len = gattValue.len;

    return SYSTEM_ERROR_NONE;
}

int ble_subscribe(uint16_t conn_handle, uint8_t char_handle) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_subscribe().");

    return 0;
}

int ble_unsubscribe(uint16_t conn_handle, uint8_t char_handle) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_unsubscribe().");

    return 0;
}

int ble_write_with_response(uint16_t conn_handle, uint8_t char_handle, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_write_with_response().");

    return 0;
}

int ble_write_without_response(uint16_t conn_handle, uint8_t char_handle, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_write_without_response().");

    return 0;
}

int ble_read(uint16_t conn_handle, uint8_t char_handle, uint8_t* data, uint16_t* len) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_read().");

    return 0;
}

int ble_get_rssi(uint16_t conn_handle) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_get_rssi().");

    return 0;
}

int ble_discovery_services(uint16_t conn_handle) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_discovery_services().");

    return 0;
}

int ble_discovery_characteristics(uint16_t conn_handle, uint16_t service_handle) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_discovery_characteristics().");

    return 0;
}

int ble_discovery_descriptors(uint16_t conn_handle, uint16_t char_handle) {
    std::lock_guard<bleLock> lk(bleLock());

    LOG_DEBUG(TRACE, "ble_discovery_descriptors().");

    return 0;
}


